In [1]:
#storing a person details in a dictonary
person = {"first": ["Ritik","Rohan","Vishal"],
         "last": ["Dhiman","Sharma","Gupta"],
         "email": ["ritik@email.com","rohan@email.com","vishal@email.com"]}
#accessing the first name by using key "first"
person['first']

['Ritik', 'Rohan', 'Vishal']

In [9]:
#accessing the all elements by their specific key
print(person['first'])
print(person['last'])
print(person['email'])

['Ritik', 'Rohan', 'Vishal']
['Dhiman', 'Sharma', 'Gupta']
['ritik@email.com', 'rohan@email.com', 'vishal@email.com']

In [13]:
import pandas as pd
#creating a dataframe using the dict.
df = pd.DataFrame(person)
df

    first    last             email
0   Ritik  Dhiman   ritik@email.com
1   Rohan  Sharma   rohan@email.com
2  Vishal   Gupta  vishal@email.com

In [16]:
df['last'] #by accessing only one column we get a series of values

0    Dhiman
1    Sharma
2     Gupta
Name: last, dtype: object

In [18]:
df[['first','last']] #by accessing multiple coulmns we get a data frame, make sure to pass the elements as a list inside df[]

    first    last
0   Ritik  Dhiman
1   Rohan  Sharma
2  Vishal   Gupta

In [19]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [20]:
"""for accessing the rows their are two methods
1. iloc -- integer value used
2. loc -- labels used"""

df.iloc[[0,1]] #for accessing first two rows

   first    last            email
0  Ritik  Dhiman  ritik@email.com
1  Rohan  Sharma  rohan@email.com

In [25]:
df.iloc[[0,1], [0,1]] #for accessing first two rows from first two columns using "iloc" method

   first    last
0  Ritik  Dhiman
1  Rohan  Sharma

In [27]:
df.loc[[0,1], ['first', 'last']] #for accessing first two rows from first two columns using "loc" method

   first    last
0  Ritik  Dhiman
1  Rohan  Sharma